app/controllers/author_controller.rb

SELECT * FROM `authors` WHERE (`authors`.`id` = 1)
---
  def show
    @author = Author.find(params[:id])

INSERT INTO `authors` (`last_name`, `book_id`, `first_name`) VALUES('Celik', NULL, 'Selvi')
---
  def create
    @author = Author.new(params[:author])
    @author.save