app/controllers/book_controller.rb

SELECT * FROM `books` WHERE (`books`.`id` = 1)
---
  def show
    @book = Book.find(params[:id])

INSERT INTO `books` (`title`, `year`, `author_id`, `publisher_id`) VALUES('My Fifth Book', 2004, 1, 1)
---
  def create
    @book = Book.new(params[:book])
    @book.save