app/controllers/publisher_controller.rb

SELECT * FROM `publishers` WHERE (`publishers`.`id` = 1)
---
  def show
    @publisher = Publisher.find(params[:id])

INSERT INTO `publishers` (`name`, `book_id`) VALUES('Oreilly Ltd.', 1)
---
  def create
    @publisher = Publisher.new(params[:publisher1])
    @publisher.save